wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_can.h
/* bits definitions */
/* CAN_CTL0 */
#define CAN_CTL0_MSZ                   BITS(0, 4)                                        /*!< memory size */
#define CAN_CTL0_FS                    BITS(8, 9)                                        /*!< format selection */
#define CAN_CTL0_FDEN                  BIT(11)                                           /*!< CAN FD operation enable */
#define CAN_CTL0_MST                   BIT(12)                                           /*!< mailbox stop transmission */
#define CAN_CTL0_LAPRIOEN              BIT(13)                                           /*!< enable local arbitration priority */
#define CAN_CTL0_PNMOD                 BIT(14)                                           /*!< Pretended Networking mode selection */
#define CAN_CTL0_DMAEN                 BIT(15)                                           /*!< enable DMA */
#define CAN_CTL0_RPFQEN                BIT(16)                                           /*!< enable rx private filters enable & rx mailbox queue */
#define CAN_CTL0_SRDIS                 BIT(17)                                           /*!< enable self reception */
#define CAN_CTL0_PNS                   BIT(18)                                           /*!< Pretended Networking state */
#define CAN_CTL0_PNEN                  BIT(19)                                           /*!< enable Pretended Networking mode */
#define CAN_CTL0_LPS                   BIT(20)                                           /*!< low power state */
#define CAN_CTL0_WERREN                BIT(21)                                           /*!< enable error warning */
#define CAN_CTL0_INAS                  BIT(24)                                           /*!< inactive mode state */
#define CAN_CTL0_SWRST                 BIT(25)                                           /*!< software reset */
#define CAN_CTL0_NRDY                  BIT(27)                                           /*!< not ready */
#define CAN_CTL0_HALT                  BIT(28)                                           /*!< halt CAN */
#define CAN_CTL0_RFEN                  BIT(29)                                           /*!< rx fifo enable */
#define CAN_CTL0_INAMOD                BIT(30)                                           /*!< enable inactive mode */
#define CAN_CTL0_CANDIS                BIT(31)                                           /*!< disable CAN */

/* CAN_CTL1 */
#define CAN_CTL1_MMOD                  BIT(3)                                            /*!< monitor mode */
#define CAN_CTL1_MTO                   BIT(4)                                            /*!< mailbox transmission order */
#define CAN_CTL1_TSYNC                 BIT(5)                                            /*!< enable time synchronization */
#define CAN_CTL1_ABORDIS               BIT(6)                                            /*!< not enable automatic bus off recovery */
#define CAN_CTL1_BSPMOD                BIT(7)                                            /*!< bit sampling mode */
#define CAN_CTL1_RWERRIE               BIT(10)                                           /*!< enable rx error warning interrupt */
#define CAN_CTL1_TWERRIE               BIT(11)                                           /*!< enable tx error warning interrupt */
#define CAN_CTL1_LSCMOD                BIT(12)                                           /*!< loopback and silent communication mode */
#define CAN_CTL1_ERRSIE                BIT(14)                                           /*!< enable error summary interrupt */
#define CAN_CTL1_BOIE                  BIT(15)                                           /*!< enable bus off interrupt */

/* CAN_TIMER */
#define CAN_TIMER_CNT                  BITS(0,15)                                        /*!< counter value */

/* CAN_RMPUBF */
#define CAN_RMPUBF_MFD0                BIT(0)                                            /*!< mailbox filter data bit 0 */
#define CAN_RMPUBF_MFD1                BIT(1)                                            /*!< mailbox filter data bit 1 */
#define CAN_RMPUBF_MFD2                BIT(2)                                            /*!< mailbox filter data bit 2 */
#define CAN_RMPUBF_MFD3                BIT(3)                                            /*!< mailbox filter data bit 3 */
#define CAN_RMPUBF_MFD4                BIT(4)                                            /*!< mailbox filter data bit 4 */
#define CAN_RMPUBF_MFD5                BIT(5)                                            /*!< mailbox filter data bit 5 */
#define CAN_RMPUBF_MFD6                BIT(6)                                            /*!< mailbox filter data bit 6 */
#define CAN_RMPUBF_MFD7                BIT(7)                                            /*!< mailbox filter data bit 7 */
#define CAN_RMPUBF_MFD8                BIT(8)                                            /*!< mailbox filter data bit 8 */
#define CAN_RMPUBF_MFD9                BIT(9)                                            /*!< mailbox filter data bit 9 */
#define CAN_RMPUBF_MFD10               BIT(10)                                           /*!< mailbox filter data bit 10 */
#define CAN_RMPUBF_MFD11               BIT(11)                                           /*!< mailbox filter data bit 11 */
#define CAN_RMPUBF_MFD12               BIT(12)                                           /*!< mailbox filter data bit 12 */
#define CAN_RMPUBF_MFD13               BIT(13)                                           /*!< mailbox filter data bit 13 */
#define CAN_RMPUBF_MFD14               BIT(14)                                           /*!< mailbox filter data bit 14 */
#define CAN_RMPUBF_MFD15               BIT(15)                                           /*!< mailbox filter data bit 15 */
#define CAN_RMPUBF_MFD16               BIT(16)                                           /*!< mailbox filter data bit 16 */
#define CAN_RMPUBF_MFD17               BIT(17)                                           /*!< mailbox filter data bit 17 */
#define CAN_RMPUBF_MFD18               BIT(18)                                           /*!< mailbox filter data bit 18 */
#define CAN_RMPUBF_MFD19               BIT(19)                                           /*!< mailbox filter data bit 19 */
#define CAN_RMPUBF_MFD20               BIT(20)                                           /*!< mailbox filter data bit 20 */
#define CAN_RMPUBF_MFD21               BIT(21)                                           /*!< mailbox filter data bit 21 */
#define CAN_RMPUBF_MFD22               BIT(22)                                           /*!< mailbox filter data bit 22 */
#define CAN_RMPUBF_MFD23               BIT(23)                                           /*!< mailbox filter data bit 23 */
#define CAN_RMPUBF_MFD24               BIT(24)                                           /*!< mailbox filter data bit 24 */
#define CAN_RMPUBF_MFD25               BIT(25)                                           /*!< mailbox filter data bit 25 */
#define CAN_RMPUBF_MFD26               BIT(26)                                           /*!< mailbox filter data bit 26 */
#define CAN_RMPUBF_MFD27               BIT(27)                                           /*!< mailbox filter data bit 27 */
#define CAN_RMPUBF_MFD28               BIT(28)                                           /*!< mailbox filter data bit 28 */
#define CAN_RMPUBF_MFD29               BIT(29)                                           /*!< mailbox filter data bit 29 */
#define CAN_RMPUBF_MFD30               BIT(30)                                           /*!< mailbox filter data bit 30 */
#define CAN_RMPUBF_MFD31               BIT(31)                                           /*!< mailbox filter data bit 31 */

